Revit 2026 API

# EnergyDataSettingsCheckRangeOfSkylightWidth Method

---

Checks that the skylight width is greater than or equal to eight inches.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CheckRangeOfSkylightWidth(
	double skylightWidth
)
```
```vb
Public Shared Function CheckRangeOfSkylightWidth (
	skylightWidth As Double
) As Boolean
```
```cpp
public:
static bool CheckRangeOfSkylightWidth(
	double skylightWidth
)
```
```fsharp
static member CheckRangeOfSkylightWidth :
        skylightWidth : float -> bool
```

#### Parameters

skylightWidth Double
     The skylight width to be checked. Should be greater than or equal to eight inches.

#### Return Value

Boolean True if the skylight width is greater than or equal to eight inches, false otherwise.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace